engineer-ae3o/stm32-hal-library/components/drivers/src/adc.c
#include "stm32f411xe.h"
#include "drivers/adc_types.h"
#include "drivers/dma_types.h"
#include "utils/common.h"
#include "drivers/gpio.h"
#include "utils/board.h"
#include "drivers/dma.h"
#include "drivers/adc.h"
#include "utils/tick.h"
#include "utils/err.h"

#include <stddef.h>
#include <stdint.h>
#include <string.h>


// Mapping for the DMA channels for the ADC peripheral instances
static const dma_map_t s_adc_dma_map[] = {
#if defined(ADC1)
    // ADC1
    {.stream = DMA2_Stream0, .channel = 0},
#endif
#if defined(ADC2)
    // ADC2
    {.stream = NULL, .channel = 0},
#endif
#if defined(ADC3)
    // ADC3
    {.stream = NULL, .channel = 0},
#endif
};

static const gpio_pin_ctx_t s_adc_channels[] = {
    [ADC_CHANNEL_0]  = {.port = GPIOA, .pin = GPIO_PIN_0},
    [ADC_CHANNEL_1]  = {.port = GPIOA, .pin = GPIO_PIN_1},
    [ADC_CHANNEL_2]  = {.port = GPIOA, .pin = GPIO_PIN_2},
    [ADC_CHANNEL_3]  = {.port = GPIOA, .pin = GPIO_PIN_3},
    [ADC_CHANNEL_4]  = {.port = GPIOA, .pin = GPIO_PIN_4},
    [ADC_CHANNEL_5]  = {.port = GPIOA, .pin = GPIO_PIN_5},
    [ADC_CHANNEL_6]  = {.port = GPIOA, .pin = GPIO_PIN_6},
    [ADC_CHANNEL_7]  = {.port = GPIOA, .pin = GPIO_PIN_7},
    [ADC_CHANNEL_8]  = {.port = GPIOB, .pin = GPIO_PIN_0},
    [ADC_CHANNEL_9]  = {.port = GPIOB, .pin = GPIO_PIN_1},
    [ADC_CHANNEL_10] = {.port = GPIOC, .pin = GPIO_PIN_0},
    [ADC_CHANNEL_11] = {.port = GPIOC, .pin = GPIO_PIN_1},
    [ADC_CHANNEL_12] = {.port = GPIOC, .pin = GPIO_PIN_2},
    [ADC_CHANNEL_13] = {.port = GPIOC, .pin = GPIO_PIN_3},
    [ADC_CHANNEL_14] = {.port = GPIOC, .pin = GPIO_PIN_4},
    [ADC_CHANNEL_15] = {.port = GPIOC, .pin = GPIO_PIN_5},
};

// User context
typedef struct {
    adc_dma_callbacks_t continuous_mode_callbacks;

    adc_callback_t injected_done_cb;
    void*          injected_done_arg;

    adc_callback_t analog_wdg_cb;
    void*          analog_wdg_arg;
} adc_ctx_t;

static adc_ctx_t s_adc_ctx[ARRAY_SIZE(s_adc_dma_map)] = {};


// Inline helpers
[[__gnu__::__always_inline__]] static inline uint8_t get_index(const ADC_TypeDef* handle) {
#if defined(ADC1)
    if (handle == ADC1) {
        return 0U;
    }
#endif
#if defined(ADC2)
    if (handle == ADC2) {
        return 1U;
    }
#endif
#if defined(ADC3)
    if (handle == ADC3) {
        return 2U;
    }
#endif
    return 0xFFU;
}

[[__gnu__::__always_inline__]] static inline void adcx_isr_helper(ADC_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    // Assert since we can't return the error anywhere
    ASSERT(idx != 0xFFU);

    // Check if end of conversion for the injected mode is reached and if interrupts for the injected group are enabled
    if ((handle->SR & ADC_SR_JEOC) && (handle->CR1 & ADC_CR1_JEOCIE)) {
        // Invoke the user callback since the sampling on the injected group is complete

        // Save the user callback so we can clear its global array position
        __disable_irq();
        const adc_callback_t local_cb  = s_adc_ctx[idx].injected_done_cb;
        void* const          user_data = s_adc_ctx[idx].injected_done_arg;

        // Clear the user passed callback since this is a one-off event
        s_adc_ctx[idx].injected_done_cb  = NULL;
        s_adc_ctx[idx].injected_done_arg = NULL;
        __enable_irq();

        // Finally, invoke the user callback
        if (local_cb) {
            local_cb(user_data);
        }

        // Clear the JEOCIE bit since the interrupt has been serviced and its oneoff
        handle->CR1 &= ~ADC_CR1_JEOCIE;
    }

    // Check if the AWD bit is set and interrupts for the analog watchdog are enabled.
    if ((handle->SR & ADC_SR_AWD) && (handle->CR1 & ADC_CR1_AWDIE)) {
        __disable_irq();
        const adc_callback_t local_cb  = s_adc_ctx[idx].analog_wdg_cb;
        void* const          user_data = s_adc_ctx[idx].analog_wdg_arg;
        __enable_irq();

        // The callback isn't cleared since this is not a one-off
        // event. To clear, adc_analog_wdg_stop() should be used.

        // Finally, invoke the user callback
        if (local_cb) {
            local_cb(user_data);
        }

        // Clear the AWD bit since the interrupt has already been serviced
        // The AWDIE bit is left since the watchdog can still trigger an interrupt
        handle->SR &= ~ADC_SR_AWD;
    }

    // Check if the OVR bit is set and interrupts for data overrun are enabled.
    if ((handle->SR & ADC_SR_OVR) && (handle->CR1 & ADC_CR1_OVRIE)) {
        // Save the user callback so it's global array position can be cleared safely
        __disable_irq();
        const adc_cont_err_cb_t local_cb  = s_adc_ctx[idx].continuous_mode_callbacks.on_data_overrun;
        void* const             user_data = s_adc_ctx[idx].continuous_mode_callbacks.user;
        __enable_irq();

        // Get the user paramters before clearing all state with adc_regular_group_cont_end_conv(...)
        DMA_Stream_TypeDef* stream = s_adc_dma_map[idx].stream;
        ASSERT(stream);

        // If the CT bit is set, buffer 1 is in use by the DMA controller. Implying
        // buffer 0 is filled up and free for us to use, and vice versa.
        const uint8_t  filled_buffer_idx = (stream->CR & DMA_SxCR_CT) ? 0 : 1;
        const uint16_t num_of_items_left = (uint16_t)stream->NDTR;

        // End the regular group conversion. The conversion can be restarted in the callback if necessary
        ASSERT(adc_regular_group_cont_end_conv(handle) == HAL_OK);

        // Finally, invoke the user callback
        if (local_cb) {
            local_cb(user_data, filled_buffer_idx, num_of_items_left);
        }
    }
}

[[__gnu__::__always_inline__]] static inline void adcx_dma_isr_helper(ADC_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    ASSERT(idx != 0xFFU);

    DMA_Stream_TypeDef* stream = s_adc_dma_map[idx].stream;
    if (stream == NULL) {
        // If the stream is NULL, we simply return as it means that DMA is not supported on the given ADC instance.
        // It is not a bug the like get_index(...) above which is why ASSERT(...) is used instead of returning there.
        return;
    }

    // If the CT bit is set, buffer 1 is in use by the DMA controller. Implying
    // buffer 0 is filled up and free for us to use, and vice versa.
    const uint8_t  filled_buffer_idx = (stream->CR & DMA_SxCR_CT) ? 0 : 1;
    const uint16_t num_of_items_left = (uint16_t)stream->NDTR;

    __disable_irq();
    const adc_cont_done_cb_t tc_local_cb  = s_adc_ctx[idx].continuous_mode_callbacks.on_buffer_full;
    const adc_cont_err_cb_t  te_local_cb  = s_adc_ctx[idx].continuous_mode_callbacks.on_transfer_error;
    const adc_cont_err_cb_t  dme_local_cb = s_adc_ctx[idx].continuous_mode_callbacks.on_direct_mode_error;
    void* const              user_data    = s_adc_ctx[idx].continuous_mode_callbacks.user;
    __enable_irq();

    // Get the stream's DMA controller and NVIC interrupt type
    dma_stream_info_t stream_info;
    ASSERT(dma_get_stream_info(stream, &stream_info) == HAL_OK);

    // Get the DMA status flags for this stream and the corresponding status and irq clear register
    dma_stream_flags_t flags;
    ASSERT(dma_get_stream_flags(stream_info.controller, &flags, stream_info.stream_number) == HAL_OK);

    const uint32_t status         = *flags.irq_status_register;
    uint32_t       flags_to_clear = 0;

    if (status & flags.tc_mask) {
        // End the conversion if we are not in circular or double buffering mode
        if (!((stream->CR & DMA_SxCR_CIRC) || (stream->CR & DMA_SxCR_DBM))) {
            ASSERT(adc_regular_group_cont_end_conv(handle) == HAL_OK);
        }

        // Clear the TC flag. The DMA_HIFCR and DMA_LIFCR are write 1 to clear
        flags_to_clear |= flags.tc_mask;

        // Transfer complete. If in circular or double buffering mode, the DMA has either
        // wrapped around in the same buffer or has switched to the second buffer respectively.
        if (tc_local_cb) {
            tc_local_cb(user_data, filled_buffer_idx);
        }
    }

    // Errors that end the conversion. Either a plain DMA transfer error or a direct mode error.
    // Conversions can be restarted by the user if necessary in the callback.
    if (status & flags.te_mask) {
        // Transfer error. End the conversion and invoke the user callback.
        ASSERT(adc_regular_group_cont_end_conv(handle) == HAL_OK);

