engineer-ae3o/stm32-hal-library/components/drivers/src/adc.c
// Control of all the ADC instances
void adc_clk_configure(adc_prescaler_t clk_prescaler) {
    // Set the ADC clock prescaler
    ADC->CCR = (ADC->CCR & ~ADC_CCR_ADCPRE) | ((uint32_t)clk_prescaler << ADC_CCR_ADCPRE_Pos);
}

gpio_pin_ctx_t adc_channel_get_gpio(adc_channel_t channel) {
    return s_adc_channels[channel];
}

void adc_configure_channel(adc_channel_t channel) {
    gpiox_clk_enable(s_adc_channels[channel].port, true);
    gpio_set_analog(s_adc_channels[channel].port, s_adc_channels[channel].pin);
}

void adc_enable_nvic_irq(bool enable) {
    if (enable) {
        NVIC_SetPriority(ADC_IRQn, ADC_NVIC_IRQ_PRIORITY);
        NVIC_EnableIRQ(ADC_IRQn);
    } else {
        NVIC_DisableIRQ(ADC_IRQn);
    }
}

void adc_power_on_temp_sensor(bool on) {
    if (on) {
        ADC->CCR |= ADC_CCR_TSVREFE;
        delay_us(TEMP_SENSOR_STARTUP_TIME_US);
    } else {
        ADC->CCR &= ~ADC_CCR_TSVREFE;
    }
}


// For use with the regular group and external channels in polling oneshot mode
hal_err_t adc_regular_group_get_oneshot(ADC_TypeDef* handle, adc_channel_t channel, uint16_t* raw_data) {
    if (handle == NULL || raw_data == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // Get the raw ADC data
    const uint16_t raw = oneshot_regular_group(handle, channel);
    if (raw == UINT16_MAX) {
        return HAL_ERR_TIMEOUT;
    }

    *raw_data = raw;
    return HAL_OK;
}


// For use with the regular group and external channels in DMA continuous sampling mode
hal_err_t adc_regular_group_cont_start_conv(ADC_TypeDef* handle, const adc_continuous_config_t* config) {
    if (handle == NULL || config == NULL || config->channels.sequence == NULL || config->channels.num_of_channels == 0 ||
        config->channels.num_of_channels > MAX_REGULAR_CHANNELS || config->buffer_1 == NULL ||
        (config->circular_mode == DMA_MODE_DOUBLE_BUFFER && config->buffer_2 == NULL) || config->buffer_size == 0 ||
        (config->trigger != RG_TRIGGER_SOFTWARE && config->trigger_polarity == ADC_POLARITY_NONE)) {
        return HAL_ERR_INVALID_ARG;
    }

    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // ADC DMA stream mapping
    DMA_Stream_TypeDef* stream = s_adc_dma_map[idx].stream;
    if (stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    if (stream->CR & DMA_SxCR_EN) {
        return HAL_ERR_INVALID_STATE;
    }

    // Clear all stale state before proceeding
    clear_state(handle, true, false);

    // Enable scan mode if we have more than one channel. Disable otherwise
    if (config->channels.num_of_channels > 1) {
        handle->CR1 |= ADC_CR1_SCAN;
    } else {
        handle->CR1 &= ~ADC_CR1_SCAN;
    }

    // Set the number of channels/conversions in the L bit positions of the
    // SQR1 register. The L bit positions are zero indexed. That is, 2 channels
    // means an L value of 0b0001, 3 channels means an L value of 0b0010 etc.
    handle->SQR1 |= ((config->channels.num_of_channels - 1) << ADC_SQR1_L_Pos) & ADC_SQR1_L;

    // Sequence numbers 1-6 go in SQR3
    // Sequence numbers 7-12 go in SQR2
    // Sequence numbers 13-16 go in SQR1
    const uint32_t sequence_bit_width = 5;
    const uint32_t sequence_bit_mask  = (1 << sequence_bit_width) - 1;

    for (size_t i = 0; i < config->channels.num_of_channels; i++) {
        if (i >= 12) {
            handle->SQR1 |= (((uint32_t)config->channels.sequence[i] & sequence_bit_mask) << ((i - 12) * sequence_bit_width));
        } else if (i >= 6) {
            handle->SQR2 |= (((uint32_t)config->channels.sequence[i] & sequence_bit_mask) << ((i - 6) * sequence_bit_width));
        } else {
            handle->SQR3 |= (((uint32_t)config->channels.sequence[i] & sequence_bit_mask) << (i * sequence_bit_width));
        }
    }

    // Enable ADC continuous sampling and DMA mode
    // Set the DDS bit only if we are in circular or double buffering mode so
    // the ADC continues to send DMA requests even after the first buffer is filled.
    if (config->circular_mode != DMA_MODE_ONESHOT) {
        handle->CR2 |= (ADC_CR2_CONT | ADC_CR2_DMA | ADC_CR2_DDS);
    } else {
        handle->CR2 |= (ADC_CR2_CONT | ADC_CR2_DMA);
    }

    // Enable the ADC overrun interrupt
    handle->CR1 |= ADC_CR1_OVRIE;

    // Configure the stream and enable the corresponding interrupts
    const dma_stream_config_t stream_config = {
        .deconfigure   = false,
        .enable_stream = true,

        .per_addr_increment = false,
        .mem_addr_increment = true,

        .tc_irq_enable  = true,
        .ht_irq_enable  = false,
        .te_irq_enable  = true,
        .dme_irq_enable = true,
        .fe_irq_enable  = false,

        .mode            = DMA_MODE_DIRECT,
        .priority        = config->priority,
        .direction       = DMA_DIR_P2M,
        .per_data_size   = DMA_SIZE_HWORD,
        .mem_data_size   = DMA_SIZE_HWORD,
        .circular_mode   = config->circular_mode,
        .flow_controller = DMA_FLOW_CONTROLLER_DMA,

        .buffer_size       = config->buffer_size,
        .channel           = s_adc_dma_map[idx].channel,
        .nvic_irq_priority = ADC_DMA_NVIC_IRQ_PRIORITY,

        .per_addr  = &handle->DR,
        .mem_buf_0 = config->buffer_1,
        .mem_buf_1 = config->circular_mode == DMA_MODE_DOUBLE_BUFFER ? config->buffer_2 : NULL,
    };
    TRY(dma_configure_stream(stream, &stream_config));

    // Copy the registered callbacks
    __disable_irq();
    s_adc_ctx[idx].continuous_mode_callbacks = config->callbacks;
    __enable_irq();

    // Finally, set the trigger source
    if (config->trigger == RG_TRIGGER_SOFTWARE) {
        // If the trigger is from software, set the SWSTART bit and return as that's all that's needed
        handle->CR2 |= ADC_CR2_SWSTART;
    } else {
        // Set the polarity of the trigger and the would be trigger source
        handle->CR2 |= (uint32_t)(config->trigger_polarity << ADC_CR2_EXTEN_Pos);
        handle->CR2 |= (uint32_t)(config->trigger << ADC_CR2_EXTSEL_Pos);
    }

    return HAL_OK;
}

hal_err_t adc_regular_group_cont_end_conv(ADC_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // ADC DMA stream mapping
    DMA_Stream_TypeDef* stream = s_adc_dma_map[idx].stream;
    if (stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Stop the conversion by clearing the necessary bits
    clear_state(handle, true, false);

    // Deinitialize the stream. This clears all DMA flags as well
    dma_stream_config_t stream_config;
    stream_config.deconfigure = true;
    TRY(dma_configure_stream(stream, &stream_config));

    // Clear all user passed callbacks
    __disable_irq();
    memset(&s_adc_ctx[idx].continuous_mode_callbacks, 0, sizeof(s_adc_ctx[idx].continuous_mode_callbacks));
    __enable_irq();

    return HAL_OK;
}


// For use with the injected group and external channels with interrupts
hal_err_t adc_injected_group_start_conv(ADC_TypeDef* handle, const adc_injected_group_config_t* config) {
    if (handle == NULL || config == NULL || config->channels.sequence == NULL || config->channels.num_of_channels == 0 ||
        config->channels.num_of_channels > MAX_INJECTED_CHANNELS) {
        return HAL_ERR_INVALID_ARG;
    }

    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

