engineer-ae3o/stm32-hal-library/components/drivers/src/adc.c
hal_err_t adc_get_temperature(ADC_TypeDef* handle, uint16_t* raw_data) {
    if (handle == NULL || raw_data == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // Wake the temperature sensor if it's not already powered on
    if (!(ADC->CCR & ADC_CCR_TSVREFE)) {
        adc_power_on_temp_sensor(true);
    }

    // Set the number of sampling cycles to 480 cycles.
    // This is done because the internal channels require
    // a much higher sampling time than the external channels
    handle->SMPR1 = (handle->SMPR1 & ~ADC_SMPR1_SMP16) | (ADC_SAMPLE_480_CYCLES << ADC_SMPR1_SMP16_Pos);

    // Get the raw ADC data
    const uint16_t raw = oneshot_regular_group(handle, ADC_CHANNEL_TEMP);
    if (raw == UINT16_MAX) {
        return HAL_ERR_TIMEOUT;
    }

    // Get the raw ADC value
    *raw_data = raw;
    return HAL_OK;
}

hal_err_t adc_get_v_ref_internal(ADC_TypeDef* handle, uint16_t* raw_data) {
    if (handle == NULL || raw_data == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // Measuring VREFINT requires the temperature sensor to be powered on
    if (!(ADC->CCR & ADC_CCR_TSVREFE)) {
        adc_power_on_temp_sensor(true);
    }

    // Set the number of sampling cycles to 480 cycles.
    // This is done because the internal channels require
    // a much higher sampling time than the external channels
    handle->SMPR1 = (handle->SMPR1 & ~ADC_SMPR1_SMP17) | (ADC_SAMPLE_480_CYCLES << ADC_SMPR1_SMP17_Pos);

    // Get the raw ADC data
    const uint16_t raw = oneshot_regular_group(handle, ADC_CHANNEL_VREF);
    if (raw == UINT16_MAX) {
        return HAL_ERR_TIMEOUT;
    }

    // Get the raw ADC value
    *raw_data = raw;
    return HAL_OK;
}


// For use of getting the actual voltages read by the ADC
hal_err_t adc_get_vdda(ADC_TypeDef* handle, float* vdda) {
    if (handle == NULL || vdda == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // All the calibration data were measured at a resolution of 12 bits
    // So we have to match that resolution to get the correct readings
    const adc_resolution_t resolution_before = (handle->CR1 & ADC_CR1_RES) >> ADC_CR1_RES_Pos;
    handle->CR1                              = (handle->CR1 & ~ADC_CR1_RES) | (ADC_RES_12_BITS << ADC_CR1_RES_Pos);

    uint16_t raw_vref = 0;
    TRY(adc_get_v_ref_internal(handle, &raw_vref));

    // Get the V_refint calibraion value. It is stored at a specific address in memory
    // It is the value of V_ref_int measured at V_dda = 3.3V and 30C

    // Calculate the actual VDDA from the calibration data
    *vdda = (3.3F * (float)VREFINT_CALIBRATION_VALUE) / (float)raw_vref;

    // Reapply the old resolution so as not to interfere with any user settings
    handle->CR1 = (handle->CR1 & ~ADC_CR1_RES) | (uint32_t)(resolution_before << ADC_CR1_RES_Pos);

    return HAL_OK;
}

hal_err_t adc_get_temp_celsius(ADC_TypeDef* handle, float* temp_celsius) {
    if (handle == NULL || temp_celsius == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // All the calibration data were measured at a resolution of 12 bits
    // So we have to match that resolution to get the correct readings
    const adc_resolution_t resolution_before = (handle->CR1 & ADC_CR1_RES) >> ADC_CR1_RES_Pos;
    handle->CR1                              = (handle->CR1 & ~ADC_CR1_RES) | (ADC_RES_12_BITS << ADC_CR1_RES_Pos);

    // Get the raw V_ref_int
    uint16_t v_ref_int = 0;
    TRY(adc_get_v_ref_internal(handle, &v_ref_int));

    // Read the raw ADC temperature sensor data
    uint16_t raw_temp = 0;
    TRY(adc_get_temperature(handle, &raw_temp));

    // Normalize the raw temperature sensor data
    const float normalized = ((float)VREFINT_CALIBRATION_VALUE / (float)v_ref_int) * (float)raw_temp;

    // Get the temperature calibration values from their locations in memory
    // They represent the temperature values measured at 30C and 110C respectively when VDDA is 3.3V
    const uint16_t temp_cal_30c  = TEMP_SENSOR_CALIB_30C_VALUE;
    const uint16_t temp_cal_110c = TEMP_SENSOR_CALIB_110C_VALUE;

    // Get the temperature using linear interpolation with the calibration data at 110C and 30C
    *temp_celsius = (((110.0F - 30.0F) / (float)(temp_cal_110c - temp_cal_30c)) * (normalized - (float)temp_cal_30c)) + 30.0F;

    // Reapply the old resolution so as not to interfere with any user settings
    handle->CR1 = (handle->CR1 & ~ADC_CR1_RES) | (uint32_t)(resolution_before << ADC_CR1_RES_Pos);

    return HAL_OK;
}

hal_err_t adc_get_value_right_aligned(ADC_TypeDef* handle, uint16_t raw_data, adc_resolution_t resolution, float* voltage) {
    if (handle == NULL || voltage == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // Get the VDDA first
    float vdda = 0.0F;
    TRY(adc_get_vdda(handle, &vdda));

    uint16_t resolution_value = 0;
    switch (resolution) {
        case ADC_RES_6_BITS:
            resolution_value = 6;
            break;
        case ADC_RES_8_BITS:
            resolution_value = 8;
            break;
        case ADC_RES_10_BITS:
            resolution_value = 10;
            break;
        case ADC_RES_12_BITS:
            resolution_value = 12;
            break;
        default:
            return HAL_ERR_INVALID_ARG;
    }

    // Calculate the final voltage
    *voltage = (vdda * (float)raw_data) / (float)(1UL << resolution_value);
    return HAL_OK;
}


// For use of control of the analog watchdog
hal_err_t adc_analog_wdg_start(ADC_TypeDef* handle, const adc_analog_wdg_config_t* config) {
    if (handle == NULL || config == NULL || config->on_thresholds_violated == NULL || config->min_adc_value >= config->max_adc_value) {
        // The use of interrupts is effectively mandatory as that's the
        // only way for the watchdog to inform the caller of a violation
        return HAL_ERR_INVALID_ARG;
    }

    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // Clear the AWDSGL bit since the monitoring is not only on an single channel
    // and clear all state before modifying any of the bits in the register(s)
    handle->CR1 &= ~(ADC_CR1_AWDIE | ADC_CR1_JAWDEN | ADC_CR1_AWDEN | ADC_CR1_AWDSGL);

