engineer-ae3o/stm32-hal-library/components/drivers/src/adc.c
    // Set the voltage sample thresholds
    handle->HTR = (handle->HTR & ~ADC_HTR_HT) | ((uint32_t)(config->max_adc_value << ADC_HTR_HT_Pos) & ADC_HTR_HT);
    handle->LTR = (handle->LTR & ~ADC_LTR_LT) | ((uint32_t)(config->min_adc_value << ADC_LTR_LT_Pos) & ADC_LTR_LT);

    if (config->monitor_regular_channels && config->monitor_injected_channels) {
        // Enable monitoring on all channels
        handle->CR1 |= (ADC_CR1_AWDEN | ADC_CR1_JAWDEN);
    } else if (config->monitor_injected_channels) {
        // Enable monitoring on only the injected channels
        handle->CR1 |= ADC_CR1_JAWDEN;
    } else if (config->monitor_regular_channels) {
        // Enable monitoring on only the regular channels
        handle->CR1 |= ADC_CR1_AWDEN;
    } else {
        return HAL_ERR_INVALID_ARG;
    }

    // Save the user passed callback
    __disable_irq();
    s_adc_ctx[idx].analog_wdg_cb  = config->on_thresholds_violated;
    s_adc_ctx[idx].analog_wdg_arg = config->arg;
    __enable_irq();

    // Enable the analog watchdog interrupt and clear any pending interrupts
    handle->SR &= ~ADC_SR_AWD;
    handle->CR1 |= ADC_CR1_AWDIE;

    return HAL_OK;
}

hal_err_t adc_analog_wdg_stop(ADC_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // Disable the analog watchdog interrupt and disable monitoring on all channels
    handle->CR1 &= ~(ADC_CR1_AWDIE | ADC_CR1_JAWDEN | ADC_CR1_AWDEN | ADC_CR1_AWDSGL);
    handle->SR &= ~ADC_SR_AWD;

    // Clear the voltage thresholds
    handle->HTR |= ADC_HTR_HT;  // Set to highest value possible
    handle->LTR &= ~ADC_LTR_LT; // Set to lowest value possible

    // Clear the user passed callback
    __disable_irq();
    s_adc_ctx[idx].analog_wdg_cb  = NULL;
    s_adc_ctx[idx].analog_wdg_arg = NULL;
    __enable_irq();

    return HAL_OK;
}


// Interrupt handlers
void ADC_IRQHandler(void) {
#if defined(ADC1)
    adcx_isr_helper(ADC1);
#endif
#if defined(ADC2)
    adcx_isr_helper(ADC2);
#endif
#if defined(ADC3)
    adcx_isr_helper(ADC3);
#endif
}

// DMA stream irq handlers
// If the used chip supports ADC2 and/or ADC3, simply copy this for use with the
// DMA stream to be used, and fill in the slot in the DMA stream map table above

// ADC1
void DMA2_Stream0_IRQHandler(void) {
    adcx_dma_isr_helper(ADC1);
}
